//IDIOMA ESPAÑOL
export const Idioma_ru = {
    ru:{
      //DATA GENERAL
      code: "ru",
      name: "русский",
      moneda_simbolo: "₽",
      unidad_medida: "Km",
      //PAGINAS COMUNES*******************************************************//
      pag_menu:{
        titulo: "меню",
        label: "пользователь:",
        opcion:{
          1:  "инициирование",
          2:  "профиль",
          3:  "Попросите поездку",
          4:  "Мои заказы",
          5:  "Моя история",
          6:  "статистика",
          7:  "Ожидаемые обследования",
          8:  "прибыль",
          9:  "Список пользователей",
          10: "Список транспортных средств",
          11: "Путешествия / Бронирование"
        }
      },
      pag_login:{
          titulo: "KB REMISERIA",
          placeholder:{
            user: 'пользователь',
            pass: 'пароль'
          },
          error:{
            required: 'Обязательное поле ↑',
            email:    'Неверный формат ↑',
          },
          button:{
            login:      'депозит',
            registro_1: 'У вас нет учетной записи?',
            registro_2: 'Зарегистрируйтесь бесплатно!'
          },
          mensaje:{
            msj_1:'Неверное имя пользователя и / или пароль',
            msj_2:'Несуществующий аккаунт',
            msj_3:'Отключена',
            msj_4:'добро пожаловать'
          }
      },
      pag_registro:{
          placeholder:{
            user:  'почта',
            pass1: 'пароль',
            pass2: 'Повторить пароль'
          },
          error:{
            required: 'Обязательное поле',
            email:    'Неверный формат',
            pass_1:   'Пароль должен быть не менее 6 символов.',
            pass_2:   'Ключ не идентичен ключу'
          },
          button:  'Регистрация',
          mensaje:{
            msj_1: 'Учетная запись недоступна',
            msj_2: 'Недействительная почта'
          }
      },
      pag_perfil:{
          label:{
            correo:     'почта',
            nombre:     'имя',
            edad:       'возраст',
            direccion:  'адрес',
            perfil:     'профиль',
            viajando:   'путешествие',
            activo:     'активный',
            verificado: 'проверенный'
          },
          error:{
            required: 'Обязательное поле',
            email:    'Неверный формат',
            nombre_1: 'Минимум: 5 символов',
            nombre_2: 'Максимум: 30 символов',
            edad_1:   'Минимальный возраст: 14',
            edad_2:   'Максимальный возраст: 100'
          },
          mensaje:{
            msj_1:    'Измененный пароль',
            msj_2:    'Неверный пароль',
            msj_3:    'Удаленный пользователь',
            msj_4:    'Почта недоступна',
            msj_5:    'Недействительная почта',
            msj_6:    'Изменения были успешно выполнены',
            msj_7:    'Созданный пользователь'
          }
      },
      pag_clave:{
          placeholder:{
            pass1:  'пароль',
            pass2:  'Новый пароль',
            pass3:  'Повторить пароль'
          },
          error:{
            required: 'Обязательное поле',
            pass_1:   'Минимум 6 символов',
            pass_2:   'Неидентичный ключ'
          },
          button: 'принимать'
      },
      pag_mapa:{
          label: 'адрес'
      },
      pag_qr:{
        msj:         "Центрировать код на прямоугольнике",
        inaccesible: "Доступ недоступен",
        desconocido: "Неизвестный код",
        navegador:   "бдительный: это тест из браузера"
      },
      pag_lista_general:{
        placeholder: 'поиск'
      },
      //PAGINAS CLIENTE*******************************************************//
      pag_viaje_cliente:{
        label:{
          origen:        "источник",
          destino:       "назначения",
          distancia:     "расстояние",
          precio:        "цена",
          hora:          "время",
          button_ok:     "готовый",
          button_cancel: "отменить"
        },
        msj_final:{
          titulo:    "КОНЕЦ МАРШРУТА",
          subtitulo: "Спасибо, что выбрали нас!",
          texto_1:   "Вы счастливы?",
          texto_2:   "Войдите в опрос и дайте нам свое мнение"
        },
        chofer:{
          titulo:  "Информация о водителе",
          nombre:  "название:",
          patente: "патент:"
        },
        estados:{
          titulo:            "СТАТУС",
          pendiente:         "Поиск водителя",
          tomado:            "Назначенный водитель - ожидайте прибытия",
          en_curso:          "Поездка началась",
          cumplido:          "Поездка выполнена",
          cancelado_cliente: "Отправлено",
          cancelado_sistema: "Система отменила поездку"
        }
      },
      pag_reserva_cliente:{
        label:{
          origen:    "Адрес происхождения",
          fecha:     "дата",
          hora:      "время",
          destino:   "Адрес места назначения",
        },
        mensaje: "Сгенерированное резервирование",
        button:{
          b_1: "экономить",
          b_2: "готовый",
          b_3: "отменить"
        }
      },
      pag_reservas_cliente:{
        titulo: "Бронирование",
        mensaje: "езерв удален"
      },
      pag_encuesta_cliente:{
        perfil: 'клиент',
        titulo: 'Обзор удовлетворенности',
        mensaje: "Спасибо за участие!",
        preguntas:{
          //SELECT
          p_1: {
              p:"Как вы оцениваете обслуживание?",
              op:{
                1:"отлично",
                2:"эффективное",
                3:"регулярный",
                4:"несовершенный",
                5:"гибельный"
              }
          },
          //RANGE
          p_2: {
              p:"Как внимание водителя?",
              op:{
                1:"Очень плохо",
                2:"плохой",
                3:"регулярный",
                4:"хорошо",
                5:"Очень хорошо"
              }
          },
          //RADIO
          p_3: {
              p:"Автомобиль был в состоянии?",
              op:{
                1:"да",
                2:"не",
                3:"Я не знаю"
              }
          },
          //CHECKBOX
          p_4: {
            p:"Был ли соблюден отмеченный маршрут?",
          },
          //INPUT
          p_5: {
            p:"комментарии"
          }
        }
      },
      pag_encuestas_cliente:{
        titulo: 'TRAVEL',
        subtitulo: '- без обследований -'
      },
      pag_historial_cliente:{
        viajes:    'путешествие',
        reservas:  'Бронирование',
        encuestas: 'опросы'
      },
      pag_estadistica_cliente:{
        subtitulo_1: 'человек',
        subtitulo_2: 'общий',
        tema:        'Качество обслуживания',
        valores:{
          1:"отлично",
          2:"эффективное",
          3:"регулярный",
          4:"несовершенный",
          5:"гибельный"
        }
      },
      //PAGINAS CHOFER********************************************************//
      pag_inicio_chofer:{
        mensaje:{
          msj_1: 'Назначить поездку',
          msj_2: 'Внимание: автомобиль недоступен или неправильный код',
          msj_3: 'внимание: ',
          msj_4: 'Правильно назначенное транспортное средство'
        }
      },
      pag_lista_viajes_chofer:{
        titulo:  'В ожидании поездок',
        label:{
          fecha: 'дата:',
          hora:  'время',
          desde: 'от:',
          hasta: 'до:'
        },
        mensaje:{
          msj_1: 'Назначить поездку',
          msj_2: 'внимание: '
        }
      },
      pag_viaje_chofer:{
        titulo: 'Информация о путешествии',
        label:{
          direccion: 'Адрес для поиска',
          destino:   'назначения',
          hora:      'время',
          precio:    'цена'
        },
        button:{
          b_1: 'отменить',
          b_2: 'Выполняется',
          b_3: 'комплимент'
        },
        mensaje:{
          msj_1: 'Путешествие в статусе: в процессе',
          msj_2: 'Поездка не была назначена',
          msj_3: 'внимание: '
        },
      },
      pag_modal_viaje_chofer:{
        titulo:'Детали поездки',
        button:'близко',
        label:{
          monto:     'Сумма платежа:',
          distancia: 'Пройденное расстояние:'
        }
      },
      pag_encuesta_chofer:{
        titulo: 'Назначенный блок управления',
        patente: 'патент',
        mensaje: "Зарегистрированный опрос",
        preguntas:{
          //SELECT
          p_1: {
              p:"Как бы вы оценили общее состояние?",
              op:{
                1:"отлично",
                2:"эффективное",
                3:"регулярный",
                4:"несовершенный",
                5:"гибельный"
              }
          },
          //RANGE
          p_2: {
              p:"Состояние очистки?",
              op:{
                1:"Очень плохо",
                2:"плохой",
                3:"регулярный",
                4:"хорошо",
                5:"Очень хорошо"
              }
          },
          //RADIO
          p_3: {
              p:"Есть ли царапины / удары?",
              op:{
                1:"да",
                2:"не",
                3:"Я не знаю"
              }
          },
          //CHECKBOX
          p_4: {
            p:"Началось ли это без проблем?"
          },
          //INPUT
          p_5: {
            p:"комментарии"
          }
        }
      },
      pag_estadistica_chofer:{
        titulo: 'репутации',
        viajes: 'Поездки: ',
        valores:{
          1:"отлично",
          2:"эффективное",
          3:"регулярный",
          4:"несовершенный",
          5:"гибельный"
        }
      },
      //PAGINAS SUPERVISOR****************************************************//
      pag_inicio_supervisor:{
        temas:{
          choferes: 'Доступные драйверы',
          viajes:   'Путешествие по штатам'
        },
        valores_viaje:{
          1:'в ожидании',
          2:'отменен',
          3:'в процессе',
          4:'комплимент'
        },
        valores_chofer:{
          1:'доступный',
          2:'Недоступно'
        },
        mensaje:{
          msj_1:  'Для этого автомобиля нет драйверов',
          msj_2:  'Недопустимый код'
        }
      },
      pag_lista_viajes_supervisor:{
        titulo: 'В ожидании поездок',
        label:  'назначения: '
      },
      pag_lista_reservas_supervisor:{
        titulo: 'Список брони',
        label:  'назначения: '
      },
      pag_lista_usuarios_supervisor:{
        mensaje:{
          msj_1: 'Удаленный пользователь',
          msj_2: 'Ошибка при выполнении действия:'
        }
      },
      pag_lista_vehiculos_supervisor:{
        mensaje: 'Автомобиль был удален'
      },
      pag_registro_usuario:{
        cliente: 'клиент',
        chofer:  'водитель'
      },
      pag_registro_chofer_supervisor:{
        label:{
          nombre:    'имя',
          apellido:  'фамилия',
          edad:      'возраст',
          direccion: 'адрес',
          correo:    'электронная почта',
          password:  'пароль'
        },
        mensaje:{
          msj_1:'Успешная регистрация',
          msj_2:'Ошибка: '
        },
        button: 'экономить'
      },
      pag_registro_vehiculo_supervisor:{
        button:{
          b_1: "консервировать",
          b_2: "редактировать"
        },
        mensaje: 'Добавлено транспортное средство',
        label:{
          marca:   'знак',
          modelo:  'модель',
          ano:     'год',
          patente: 'патент',
          activo:  'активный'
        },
        placeholder:{
          1: 'ABC123',
          2: 'AB123CD'
        },
        error:{
          marca:     'Минимум 3 символа',
          patente_1: 'Не добавлять пробелы',
          patente_2: 'Правильный формат [ ABC123 ]',
          patente_3: 'Правильный формат [ AB123CD ]'
        }
      },
      pag_photoTaker_supervisor:{
        button:{
          b_1: 'консервировать',
          b_2: 'загружать'
        },
        mensaje:{
          msj_1: 'Фото вверх',
          msj_2: 'Фотография удалена'
        }
      },
      pag_choferes_disponibles_supervisor:{
        titulo: 'Доступные драйверы'
      },
      pag_asignar_viaje_supervisor:{
        titulo: 'Назначить поездку',
        label:{
          chofer:  'водитель: ',
          datos:   'Информация о путешествии',
          origen:  'источник: ',
          destino: 'назначения: ',
          fecha:   'дата:',
          hora:    'время:'
        },
        button:{
          b_1: 'назначать',
          b_2: 'Удалить назначение'
        }
      }

    }
}
